## Question 1: **Answer**

In [1]:
import sqlite3

In [ ]:
def add_data_to_database():
    try:
        # Connect to the SQLite database
        with sqlite3.connect('sales_team_data.db') as conn:
            cursor = conn.cursor()
            # Create the table
            cursor.execute('''
            CREATE TABLE IF NOT EXISTS sales (
                id INTEGER PRIMARY KEY,
                sales_person TEXT,
                age INTEGER,
                year INTEGER,
                sales_value INTEGER
            )
            ''')
            # Insert data into the table
            cursor.executemany('''
            INSERT INTO sales (id, sales_person, age, year, sales_value)
            VALUES (?, ?, ?, ?, ?)
            ''', [
                (1, 'John', 28, 2001, 1500),
                (2, 'Mary', 34, 2023, 2200),
                (3, 'Ken', 29, 2022, 1800),
                (4, 'John', 28, 2021, 2500),
                (5, 'Sarah', 31, 2023, 1300),
                (6, 'Mary', 34, 2022, 2600),
                (7, 'Ken', 29, 2002, 1400),
                (8, 'Sarah', 31, 2001, 1900)
            ])
            conn.commit()
            print("Table created successfully.")
    except Exception as e:
        print(f"Error: {e}")

# Calling the function
add_data_to_database()

Table created successfully.

In [3]:
# Loading SQL extension
%load_ext sql

In [4]:
# Connnecting to the database
%sql sqlite:///sales_team_data.db

In [5]:
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

## 1. Question 2: **Answer**
Rewrite the query using the IN operator.

In [6]:
%%sql
SELECT sales_value
FROM sales
WHERE sales_person = 'John'
      OR sales_person = 'Mary'
      OR sales_person = 'Ken';

 * sqlite:///sales_team_data.db
Done.

[(1500,), (2200,), (1800,), (2500,), (2600,), (1400,)]

In [7]:
%%sql
SELECT sales_value
FROM sales
WHERE sales_person IN ('John', 'Mary', 'Ken');

 * sqlite:///sales_team_data.db
Done.

[(1500,), (2200,), (1800,), (2500,), (2600,), (1400,)]

## Question 3: **Answer**

In [8]:
%%sql
SELECT
    sales_person,
    sales_value
FROM sales
WHERE sales_value BETWEEN 1400 AND 2500
ORDER BY sales_value DESC;

 * sqlite:///sales_team_data.db
Done.

[('John', 2500),
 ('Mary', 2200),
 ('Sarah', 1900),
 ('Ken', 1800),
 ('John', 1500),
 ('Ken', 1400)]

## Question 4: **Answer**

In [9]:
%%sql
SELECT
    sales_person,
    sales_value
FROM sales
WHERE sales_person IN ('John', 'Mary', 'Ken')
      AND sales_value BETWEEN 1400 AND 2500
ORDER BY sales_value DESC;

 * sqlite:///sales_team_data.db
Done.

[('John', 2500), ('Mary', 2200), ('Ken', 1800), ('John', 1500), ('Ken', 1400)]

## Questions 5: **Answer**

In [10]:
%%sql
SELECT
    SUM(sales_value) AS total_sales
FROM sales
WHERE year IN (2001, 2002, 2003);

 * sqlite:///sales_team_data.db
Done.

[(4800,)]

## Questions 6: **Answer**

In [11]:
%%sql
SELECT
    SUM(sales_value) AS total_sales
FROM sales
-- Same as year IN (2001, 2002, 2003)
WHERE year BETWEEN 2001 AND 2003;

 * sqlite:///sales_team_data.db
Done.

[(4800,)]